; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 15477)
	(= (fuel plane1) 3338)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city0)
	(= (capacity plane2) 2522)
	(= (fuel plane2) 20)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city0)
	(= (capacity plane3) 10525)
	(= (fuel plane3) 1405)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 12)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city0)
	(= (capacity plane4) 8923)
	(= (fuel plane4) 779)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 8)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 9)
	(at plane5 city6)
	(= (capacity plane5) 7116)
	(= (fuel plane5) 2226)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 8)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 8)
	(at person1 city2)
	(at person2 city6)
	(at person3 city7)
	(at person4 city8)
	(at person5 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 702)
	(= (distance city0 city2) 709)
	(= (distance city0 city3) 635)
	(= (distance city0 city4) 845)
	(= (distance city0 city5) 859)
	(= (distance city0 city6) 882)
	(= (distance city0 city7) 593)
	(= (distance city0 city8) 712)
	(= (distance city1 city0) 702)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 787)
	(= (distance city1 city3) 642)
	(= (distance city1 city4) 504)
	(= (distance city1 city5) 636)
	(= (distance city1 city6) 804)
	(= (distance city1 city7) 828)
	(= (distance city1 city8) 767)
	(= (distance city2 city0) 709)
	(= (distance city2 city1) 787)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 759)
	(= (distance city2 city4) 716)
	(= (distance city2 city5) 510)
	(= (distance city2 city6) 605)
	(= (distance city2 city7) 876)
	(= (distance city2 city8) 950)
	(= (distance city3 city0) 635)
	(= (distance city3 city1) 642)
	(= (distance city3 city2) 759)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 708)
	(= (distance city3 city5) 626)
	(= (distance city3 city6) 876)
	(= (distance city3 city7) 599)
	(= (distance city3 city8) 828)
	(= (distance city4 city0) 845)
	(= (distance city4 city1) 504)
	(= (distance city4 city2) 716)
	(= (distance city4 city3) 708)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 745)
	(= (distance city4 city6) 718)
	(= (distance city4 city7) 549)
	(= (distance city4 city8) 711)
	(= (distance city5 city0) 859)
	(= (distance city5 city1) 636)
	(= (distance city5 city2) 510)
	(= (distance city5 city3) 626)
	(= (distance city5 city4) 745)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 840)
	(= (distance city5 city7) 752)
	(= (distance city5 city8) 921)
	(= (distance city6 city0) 882)
	(= (distance city6 city1) 804)
	(= (distance city6 city2) 605)
	(= (distance city6 city3) 876)
	(= (distance city6 city4) 718)
	(= (distance city6 city5) 840)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 975)
	(= (distance city6 city8) 597)
	(= (distance city7 city0) 593)
	(= (distance city7 city1) 828)
	(= (distance city7 city2) 876)
	(= (distance city7 city3) 599)
	(= (distance city7 city4) 549)
	(= (distance city7 city5) 752)
	(= (distance city7 city6) 975)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 780)
	(= (distance city8 city0) 712)
	(= (distance city8 city1) 767)
	(= (distance city8 city2) 950)
	(= (distance city8 city3) 828)
	(= (distance city8 city4) 711)
	(= (distance city8 city5) 921)
	(= (distance city8 city6) 597)
	(= (distance city8 city7) 780)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at plane3 city7)
	(at person1 city4)
	(at person2 city1)
	(at person3 city5)
	(at person4 city2)
	(at person5 city5)
	))

(:metric minimize (+ (* 5 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane3 city0)
   changed: (fuel plane3) from 1405 to 10525
   goals met: 0 of 7
2. (refuel plane1 city6)
   changed: (fuel plane1) from 3338 to 15477
   goals met: 0 of 7
3. (board person5 plane3 city0)
   deleted: (at person5 city0)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 7
4. (fly plane3 city0 city7)
   deleted: (at plane3 city0)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 0 to 2372, (fuel plane3) from 10525 to 8153
   goals met: 1 of 7
5. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 7
6. (board person3 plane3 city7)
   deleted: (at person3 city7)
   added: (in person3 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 7
7. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2372 to 5397, (fuel plane1) from 15477 to 12452
   goals met: 1 of 7
8. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 7
9. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 5397 to 8977, (fuel plane1) from 12452 to 8872
   goals met: 1 of 7
10. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 7
11. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 8977 to 11497, (fuel plane1) from 8872 to 6352
   goals met: 2 of 7
12. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 7
13. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 11497 to 14707, (fuel plane1) from 6352 to 3142
   goals met: 4 of 7
14. (fly plane3 city7 city5)
   deleted: (at plane3 city7)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 14707 to 17715, (fuel plane3) from 8153 to 5145
   goals met: 3 of 7
15. (debark person3 plane3 city5)
   deleted: (in person3 plane3)
   added: (at person3 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 4 of 7
16. (debark person5 plane3 city5)
   deleted: (in person5 plane3)
   added: (at person5 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 5 of 7
17. (fly plane3 city5 city7)
   deleted: (at plane3 city5)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 17715 to 20723, (fuel plane3) from 5145 to 2137
   goals met: 6 of 7
18. (fly plane5 city6 city8)
   deleted: (at plane5 city6)
   added: (at plane5 city8)
   changed: (total-fuel-used) from 20723 to 22514, (fuel plane5) from 2226 to 435
   goals met: 6 of 7
19. (board person4 plane5 city8)
   deleted: (at person4 city8)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 6 of 7
20. (refuel plane5 city8)
   changed: (fuel plane5) from 435 to 7116
   goals met: 6 of 7
21. (fly plane5 city8 city2)
   deleted: (at plane5 city8)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 22514 to 25364, (fuel plane5) from 7116 to 4266
   goals met: 6 of 7
22. (debark person4 plane5 city2)
   deleted: (in person4 plane5)
   added: (at person4 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 7 of 7
